# event_maps.py
event_maps = {
    "loging_event": {
        "10001": "微信登陆成功",
    },
    "group_event": {
        "10012": "群成员新增事件",
        "10013": "群成员删除/退出事件",
        "10014": "群创建成功事件",
        "10015": "退群/被踢事件",
        "10003": {
            "1": "群聊消息事件",
            "3": "群聊图片消息事件",
            "34": "群聊语音消息事件",
            "43": "群聊视频消息事件",
            "47": "群聊表情消息事件",
            "49": "群聊文件消息事件"
        }
    },
    "friends_event": {
        "10010": "好友新增事件",
        "10011": "好友删除事件",
        "10007": "好友申请事件",
    },
    "login_event": {
        "10016": "登录二维码事件",
        "10001": "微信登陆成功",
        "10009": "微信账号注销成功",
    },
    "private_chat_event": {
        "10002": {
            "1": "私聊消息事件",
            "3": "私聊图片消息事件",
            "34": "私聊语音消息事件",
            "43": "私聊视频消息事件",
            "47": "私聊表情消息事件"
        }
    },
    "payment_event": {
        "10005": "转账事件",
        "10008": "二维码收款事件"
    },
    "regret_event": {
        "10006": "撤回消息事件"
    },
    "public_event": {
        "10004": "公众号消息事件"
    },
    "robot_event": {
        "10000": "微信启动成功"
    }
}